Tekla.Structures.ModelInternal.dotWeldGeometry_t
Struct for the WeldGeometry object.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.WeldId
Identifier of the weld.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.Position
Enum to indicate seam position (above or below).

Tekla.Structures.ModelInternal.dotWeldGeometry_t.NumberOfPolygons
Number of polygons.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.PolygonIndex
Determines the current polygon index.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.PointIndex
Defines the current polygon point index.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.MorePoints
Determines if there are still more points in one polygon that must be fetched.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.MaxPolygonPoints
Determines the maximum amount of polygon points per each request.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.Polygon
Defines one polygon of a weld seam.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.#ctor(Tekla.Structures.Identifier,System.Int32,System.Int32)
Initializes a new instance of the Tekla.Structures.ModelInternal.dotWeldGeometry_t struct.
weldId: Weld identifier.
position: Position of the seam (above or below).
maxPolygonPointsPerRequest: Maximum polygon points per request.

Tekla.Structures.ModelInternal.dotWeldGeometry_t.CopyAndInitialize
Makes a copy of another Tekla.Structures.ModelInternal.dotWeldGeometry_t struct and initializes the weld geometry polygon.
Returns: An instance of the Tekla.Structures.ModelInternal.dotWeldGeometry_t struct.